evaluacionlambda.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-25 Tue 11:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Evaluación en cálculo lambda</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Mario Román</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Evaluación en cálculo lambda</h1>
<p>
Esta es una recopilación de los enunciados que nos llevan a usar la
evaluación mediante &beta;-reducciones del cálculo lambda como un
lenguaje de programación.  Los obtuve principalmente del libro de
Barendregt y de las notas de Peter Selinger cuando buscaba la base
teórica para implementar <a href="mikrokosmos.html">Mikrokosmos</a> Detallo estos mismos
enunciados recopilando sus demostraciones en <a href="https://github.com/M42/lambda.notes">M42/lambda.notes</a>.
</p>

<div id="outline-container-org3bd6fa5" class="outline-2">
<h2 id="org3bd6fa5">Forma normal</h2>
<div class="outline-text-2" id="text-org3bd6fa5">
<p>
Una expresión está en <i>forma normal</i> si no se le pueden aplicar más
&beta;-reducciones. La forma normal es <i>única</i> como consecuencia del
teorema de Church-Rosser.
</p>

<p>
<b>Teorema de Chuch-Rosser.</b> Si a un mismo término se le aplican dos
cadenas de reducciones distintas, los términos que se obtienen pueden
a su vez reducirse a un término común. Es decir,
</p>

<ul class="org-ul">
<li>si A puede reducirse mediante β-reducciones a otro término
B, lo que se nota por  A -{β}-&gt; B,</li>
<li>y A puede reducirse también mediante otras β-reducciones,
posiblemente distintas o en distinto orden, a C, como A -{β}-&gt; C,</li>
<li>entonces existe un término D tal que ambos se pueden reducir
mediante β-reducciones a él; es decir, tal que B -{β}-&gt; D
y C -{β}-&gt; D.</li>
</ul>

<p>
En particular, esto implica que si un término tuviera dos formas
normales, debería existir otro término al cual se pudieran reducir
ambas; como son formas normales y no pueden reducirse, esto debe
implicar que son iguales.
</p>
</div>
</div>

<div id="outline-container-org416e609" class="outline-2">
<h2 id="org416e609">Divergencia</h2>
<div class="outline-text-2" id="text-org416e609">
<p>
Hemos visto que la forma normal es única, pero no que exista o que
sepamos encontrarla de alguna forma. Puede ocurrir que un término no
esté en forma normal y sin embargo las reducciones no lo lleven a
ella.  Por ejemplo, el término Ω = (λ x.x x)(λ x.x x)
es invariante a β-reducciones y <b>no llega a forma normal</b>. O por 
ejemplo, el término (λ x.x x x)(λ x.x x x) se hace cada vez más grande
al aplicarle reducciones, decimos que <i>diverge</i>.
</p>
</div>
</div>

<div id="outline-container-org2c25fc9" class="outline-2">
<h2 id="org2c25fc9">Evaluación a izquierda</h2>
<div class="outline-text-2" id="text-org2c25fc9">
<p>
Hay expresiones que llegarán a una forma normal o no dependiendo de
cómo los evaluemos. Por ejemplo, el término <code>(const id Ω)</code> llega a
la forma normal <code>id</code> si evaluamos primero la aplicación de <code>const</code>,
pero diverge si empezamos intentando evaluar Ω. 
Sin embargo, existe una estrategia de reducción que siempre encuentra
una forma normal si esta existe. Tenemos el siguiente teorema.
</p>

<ul class="org-ul">
<li>Si existe una forma normal, la estrategia que reduce a cada paso
la aplicación más a la izquierda posible la encuentra.</li>
</ul>

<p>
Y quizá sorprendentemente, existe otra estrategia de reducción que siempre
encuentra la forma de <b>no</b> llegar a la forma normal si esta existiera.
</p>

<ul class="org-ul">
<li>Si existe alguna sucesión que no llega a forma normal, la
estrategia que reduce a cada paso la aplicación más a la derecha
posible la encuentra.</li>
</ul>

<p>
Estas dos formas de evaluación se suelen llamar <i>call-by-value</i> y
<i>call-by-name</i>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited . Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
